---
kind: property
id: P:Autodesk.Revit.DB.SunAndShadowSettings.UsesDST
source: html/34284848-ddf6-1fda-d1d2-43f8c2e2ad78.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.UsesDST Property

Identifies whether the SunAndShadowSettings element is using daylight savings time.

## Syntax (C#)
```csharp
public bool UsesDST { get; }
```